import styled from 'styled-components';
import '../components/App.styled';
import Slider from '../components/Slider/Slider';

export const P = styled.p`
  margin-top: 40px;
  color: white;
  font-size: 20px;
`;

export const H1 = styled.h1`
  color: white;
`;

export const Img = styled.img`
  width: 500px;
  height: auto;
  margin: 0 auto;
`;

const About = () => {
  return (
    <main>
      <Slider></Slider>
      <H1>Про M8L8TH</H1>
      <P>
        M8L8TH — це більше, ніж просто музичний проєкт. Це філософія, виражена
        через потужний звук, глибокі тексти та безкомпромісну ідеологію. Наша
        музика — це відображення боротьби, прагнення до самовдосконалення та
        вірності своїм ідеалам. Кожен альбом — це окрема історія, що поєднує в
        собі теми честі, традицій, сили духу та боротьби за власну ідентичність.
        Ми черпаємо натхнення з історичних подій, міфології та сучасного світу,
        щоб створювати музику, яка виходить за межі простого звучання. M8L8TH —
        це звук, що несе в собі послання про волю, рішучість та незламність.
        Наші слухачі — це люди, які поділяють наші цінності та прагнуть до
        глибшого розуміння себе і навколишнього світу. Ми продовжуємо рухатися
        вперед, розвиватися та вдосконалюватися, зберігаючи відданість своєму
        творчому шляху.
      </P>
    </main>
  );
};
export default About;
